tutorials/taylorCouette/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
// 3.2 x 3.2 box with N x N cells; the fluid is the interior of the disk R = 1 at the centre
L 3.2; N 40;
dz #eval{ $L / $N };
scale 1;
vertices ( (0 0 0) ($L 0 0) ($L $L 0) (0 $L 0) (0 0 $dz) ($L 0 $dz) ($L $L $dz) (0 $L $dz) );
blocks ( hex (0 1 2 3 4 5 6 7) ($N $N 1) simpleGrading (1 1 1) );
boundary
(
    left   { type cyclic; neighbourPatch right;  faces ((0 4 7 3)); }
    right  { type cyclic; neighbourPatch left;   faces ((1 2 6 5)); }
    bottom { type cyclic; neighbourPatch top;    faces ((0 1 5 4)); }
    top    { type cyclic; neighbourPatch bottom; faces ((3 7 6 2)); }
    frontAndBack { type empty; faces ((0 3 2 1) (4 5 6 7)); }
);
